class UserMessages:
    account_created_message = 'На указанный адрес электронной почты отправлено письмо со ссылкой для подтверждения.'
    form_password_reset = 'Если этот адрес совпадает с адресом, указанным для вашей учетной записи, вы вскоре получите электронное письмо для сброса пароля.'

class UserErrorMessages:
    unexpected_error = 'Что-то пошло не так. Пожалуйста, обновите страницу.'
    field_required = 'Поле %s является обязательным.'
    field_min_length = 'Минимальная длина поля %s — %s символов.'
    
    email_taken = 'Указанный адрес электронной почты уже используется, выберите другой.'
    password_mismatch = 'Два поля пароля не совпадают.'
    policy_required = 'Требуется принятие условий политики.'
    invalid_login = 'Пожалуйста, введите правильный адрес электронной почты и пароль. Учтите что оба поля могут быть чувствительны к регистру.'
    inactive = 'Этот аккаунт не активен.'
    unverified_email = 'Ваш адрес электронной почты не подтвержден. Проверьте свою электронную почту.'
    same_password = 'Новый пароль должен отличаться от текущего.'
    password_incorrect = 'Ваш текущий пароль был введен неверно. Пожалуйста, введите его еще раз.'
    verification_error = 'Ошибка подтверждения электронной почты! Возможно, ваша ссылка повреждена.'
    email_empty = 'Электронная почта должна быть установлена.'
